/**
 * vim: set ts=4 :
 * =============================================================================
 * SourceMod P Tools and Hooks Extension
 * Copyright (C) 2016-2020 Phoenix (˙·٠●Феникс●٠·˙).  All rights reserved.
 * =============================================================================
 *
 * This program is free software; you can redistribute it and/or modify it under
 * the terms of the GNU General Public License, version 3.0, as published by the
 * Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS
 * FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more
 * details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#ifndef _INCLUDE_SOURCEMOD_EXTENSION_CLASSES_H_
#define _INCLUDE_SOURCEMOD_EXTENSION_CLASSES_H_

class CAttribute_String;
class stickerMaterialReference_t;

enum EStickerAttributeType
{
	StickerID,
	WearProgress,
	PatternScale,
	PatternRotation
};

class ISchemaAttributeType
{
protected:
	virtual ~ISchemaAttributeType() { }
};

template<typename T> class ISchemaAttributeTypeBase : public ISchemaAttributeType {};
template<typename T> class CSchemaAttributeTypeBase : public ISchemaAttributeTypeBase<T> {};
template<typename T> class CSchemaAttributeTypeProtobufBase : public CSchemaAttributeTypeBase<T> {};

class CSchemaAttributeType_Default : public CSchemaAttributeTypeBase<unsigned int> {};
class CSchemaAttributeType_Uint32 : public CSchemaAttributeTypeBase<unsigned int> {};
class CSchemaAttributeType_Float : public CSchemaAttributeTypeBase<float> {};
class CSchemaAttributeType_String : public CSchemaAttributeTypeProtobufBase<CAttribute_String> {};
class CSchemaAttributeType_Vector : public CSchemaAttributeTypeBase<Vector> {};

class CEconItemAttributeDefinition
{
public:
	virtual uint16_t GetDefinitionIndex() const = 0;
	virtual const char* GetDefinitionName() const = 0;
	virtual const char* GetDescriptionString() const = 0;
	virtual const char* GetAttributeClass() const = 0;
	virtual const KeyValues* GetRawDefinition() const = 0;

	template<typename T> bool IsAttributeType() const
	{
		return (dynamic_cast<T*>(this->m_pAttributeType) != nullptr);
	}

	KeyValues* m_pKVAttribute;
	uint16_t m_nDefIndex;
	ISchemaAttributeType* m_pAttributeType;
};

class CEconItemDefinition
{
public:
	uint16_t GetDefinitionIndex();
	int GetLoadoutSlot(int iTeam);
	int GetNumSupportedStickerSlots();
	const char* GetEconImage();
	const char* GetViewModel();
	const char* GetWorldModel();
	const char* GetDroppedModel();
	const char* GetClassName();
};

class CEconItemSchema
{
public:
	static void* operator new(size_t) throw();
	static void operator delete(void*) { };
	CEconItemDefinition* GetItemDefinitionByName(const char* classname);
	CEconItemDefinition* GetItemDefinitionByDefIndex(uint16_t DefIndex);

	CEconItemAttributeDefinition* GetAttributeDefinitionByDefIndex(uint16_t DefIndex);
};

class IEconItemAttributeIterator
{
public:
	virtual ~IEconItemAttributeIterator() {	};
	virtual bool OnIterateAttributeValue(CEconItemAttributeDefinition const*, unsigned int) = 0;
	virtual bool OnIterateAttributeValue(CEconItemAttributeDefinition const*, float) = 0;
	virtual bool OnIterateAttributeValue(CEconItemAttributeDefinition const*, CAttribute_String const&) = 0;
	virtual bool OnIterateAttributeValue(CEconItemAttributeDefinition const*, Vector const&) = 0;
};

class CEconItemAttribute
{
	DECLARE_CLASS_NOBASE(CEconItemAttribute);

	CEconItemAttribute();

public:
	DECLARE_EMBEDDED_NETWORKVAR();

	CEconItemAttribute(const uint16 iAttributeIndex, uint32 unValue);
	CEconItemAttribute(const uint16 iAttributeIndex, float fValue);

	// This is the index of the attribute into the attributes read from the data files
	CNetworkVar(uint16, m_iAttributeDefinitionIndex);

	// This is the value of the attribute. Used to modify the item's variables.
	CNetworkVar(float, m_flValue);

	// This is the value that the attribute was first set to by an item definition
	CNetworkVar(float, m_flInitialValue);
	CNetworkVar(int, m_nRefundableCurrency);

	CNetworkVar(bool, m_bSetBonus); // Attribute has been generated by a set bonus.
};
static_assert(sizeof(CEconItemAttribute) == 24, "CEconItemAttribute - incorrect size on this compiler");

#ifdef PLATFORM_WINDOWS
//https://github.com/alliedmodders/sourcemod/blob/c5619f887d6d13643ad8281e8e7479668226c342/core/HalfLife2.cpp#L1234
template< class T, class I = int >
class CUtlMemoryGlobalMalloc : public CUtlMemory< T, I >
{
	typedef CUtlMemory< T, I > BaseClass;

public:
	using BaseClass::BaseClass;

	void Purge()
	{
		if (!IsExternallyAllocated())
		{
			if (m_pMemory)
			{
				UTLMEMORY_TRACK_FREE();
				g_pMemAlloc->Free((void*)m_pMemory);
				m_pMemory = 0;
			}
			m_nAllocationCount = 0;
		}
		BaseClass::Purge();
	}
};
#endif

class CAttributeList
{
public:
	void DestroyAllAttributes() { m_Attributes.Purge(); }
	void AddAttribute(CEconItemAttribute& pAttribute) { m_Attributes.AddToTail(pAttribute); }
	void RemoveAttribute(int iIndex) { m_Attributes.Remove(iIndex); }
	void RemoveAttributeByDefIndex(uint16_t unAttrDefIndex);
	void SetOrAddAttributeValue(uint16_t unAttrDefIndex, uint32_t unValue);
	int	 GetNumAttributes() { return m_Attributes.Count(); }
	CEconItemAttribute& GetAttribute(int iIndex) { return m_Attributes[iIndex]; }
	CEconItemAttribute* GetAttributeByDefIndex(uint16_t unAttrDefIndex);

private:
	void* m_pVTable;
#ifdef PLATFORM_WINDOWS
	CUtlVector<CEconItemAttribute, CUtlMemoryGlobalMalloc<CEconItemAttribute> > m_Attributes;
#else
	CUtlVector<CEconItemAttribute> m_Attributes;
#endif
	void* m_pAttributeManager;
};

class CEconItemView
{
public:
	int GetCustomPaintKitIndex();
	int GetCustomPaintKitSeed();
	float GetCustomPaintKitWear(float def);
	float GetStickerAttributeBySlotIndexFloat(int slot, EStickerAttributeType StickerAttribut, float def);
	int GetStickerAttributeBySlotIndexInt(int slot, EStickerAttributeType StickerAttribut, int def);
	bool IsTradable();
	bool IsMarketable();
	CEconItemDefinition* GetItemDefinition();
	uint32 GetAccountID() { return m_iAccountID; }
	uint64 GetItemID() { return m_iItemID; }
	int GetQuality();
	int GetRarity();
	int GetFlags();
	int GetOrigin();
	const char* GetCustomName();
	int GetKillEaterValue();

	void IterateAttributes(IEconItemAttributeIterator* AttributeIterator);

private:
	void* m_pVTable; //0
	bool m_bKillEaterTypesCached; //4
	void* m_vCachedKillEaterTypes[7]; //8 (28)
	int m_nKillEaterValuesCacheFrame; //36
	void* m_vCachedKillEaterValues[6]; //40 (24)
	CUtlVector<stickerMaterialReference_t> m_pStickerMaterials; //64 (20)

public:
	uint16 m_iDefinitionIndex; //84
	int m_iEntityQuality; //88
	uint32 m_iEntityLevel; //92
	uint64 m_iItemID; //96
	uint32 m_iItemIDHigh; //104
	uint32 m_iItemIDLow; //108
	uint32 m_iAccountID; //112
	uint32 m_iInventoryPosition; //116
	void* m_pNonSOEconItem; //120
	bool m_bInitialized; //124

	CAttributeList m_AttributeList; //128 (28)
	CAttributeList m_NetworkedDynamicAttributesForDemos; //156 (28)

	char m_szCustomName[161]; //184
	char m_szCustomNameOverride[161]; //345
	void* m_autoptrInventoryImageGeneratedPath; //508
};
static_assert(sizeof(CEconItemView) == 512, "CEconItemView - incorrect size on this compiler");

class IEconItemUntypedAttributeIterator : public IEconItemAttributeIterator
{
public:
	virtual bool OnIterateAttributeValue(CEconItemAttributeDefinition const*, unsigned int);
	virtual bool OnIterateAttributeValue(CEconItemAttributeDefinition const*, float);
	virtual bool OnIterateAttributeValue(CEconItemAttributeDefinition const*, CAttribute_String const&);
	virtual bool OnIterateAttributeValue(CEconItemAttributeDefinition const*, Vector const&);
	virtual bool OnIterateAttributeValueUntyped(CEconItemAttributeDefinition const*) = 0;
};

class CAttributeIterator_HasAttribute : public IEconItemUntypedAttributeIterator
{
public:
	CAttributeIterator_HasAttribute(CEconItemAttributeDefinition const*);
	virtual bool OnIterateAttributeValueUntyped(CEconItemAttributeDefinition const*);

	CEconItemAttributeDefinition const* m_pItemAttrDef;
	bool m_found;
};

class CAttributeIterator_GetTypedAttributeValueBase : public IEconItemAttributeIterator
{
public:
	virtual bool OnIterateAttributeValue(CEconItemAttributeDefinition const*, unsigned int) { return true; }
	virtual bool OnIterateAttributeValue(CEconItemAttributeDefinition const*, float) { return true; }
	virtual bool OnIterateAttributeValue(CEconItemAttributeDefinition const*, CAttribute_String const&) { return true; }
	virtual bool OnIterateAttributeValue(CEconItemAttributeDefinition const*, Vector const&) { return true; }
};

template <class A, class B>
class CAttributeIterator_GetTypedAttributeValue : public CAttributeIterator_GetTypedAttributeValueBase
{
public:
	CAttributeIterator_GetTypedAttributeValue(CEconItemAttributeDefinition const* pItemAttrDef, B* value)
		: m_pItemAttrDef(pItemAttrDef), m_value(value), m_found(false)
	{
	}
	virtual bool OnIterateAttributeValue(CEconItemAttributeDefinition const* pItemAttrDef, A value)
	{
		if (m_pItemAttrDef == pItemAttrDef)
		{
			m_found = true;
			*m_value = (B)value;
		}

		return !m_found;
	}

	CEconItemAttributeDefinition const* m_pItemAttrDef;
	B* m_value;
	bool m_found;
};

class CPlayerVoiceListener
{
public:
	static void* operator new(size_t) throw();
	static void operator delete(void*) { };

	bool IsPlayerSpeaking(int iClient);
};

class CGameClient
{
public:
	inline IClient* ToIClient()
	{
		return (IClient*)((intptr_t)this + sizeof(void*));
	}
};

#define IClientToGameClient(pClient) (CGameClient*)((intptr_t)(pClient) - sizeof(void*))

class CCSPlayerInventory
{
	static intptr_t GetInventoryOffset();
public:
	static CCSPlayerInventory* FromPlayer(CBaseEntity* pPlayer);
	CBaseEntity* ToPlayer();

	CEconItemView* GetItemInLoadout(int iTeam, int iLoadoutSlot);
	CUtlVector<CEconItemView*>* GetItems();
};


extern CEconItemSchema* g_pCEconItemSchema;
extern CPlayerVoiceListener* g_pCPlayerVoiceListener;

#endif // _INCLUDE_SOURCEMOD_EXTENSION_CLASSES_H_